_posts/2021-09-25-board-game-reviews.html
---
layout: post
title: "Board Game Reviews"
permalink: /:title/
tags: [reviews, board games]
---
<div id="outline-container-org3d4fb0e" class="outline-2">
<h2 id="org3d4fb0e">7 Wonders Duel</h2>
<div class="outline-text-2" id="text-org3d4fb0e">
<p>
An impressive little game that somehow fits many of the highs of a game of <i>Sid Meier's Civilization</i> into a fast-paced 30-minute drafting game. I enjoy the <i>Pantheon</i> expansion for strengthening science and military while adding more interesting choices and effects, but it does make it more thinky and slows things down.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org7e7191c" class="outline-2">
<h2 id="org7e7191c">Azul</h2>
<div class="outline-text-2" id="text-org7e7191c">
<p>
Functions very well as a gateway game for people happy to think strategically, but is a little too cutthroat (low player counts) or random (high player counts). I'm shocked at how terrible I am at it, which probably doesn't help.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-org3169594" class="outline-2">
<h2 id="org3169594">Baseball Highlights: 2045</h2>
<div class="outline-text-2" id="text-org3169594">
<p>
Although it's a straightforward deckbuilder, and the strategy and tactics aren't especially deep, the theming is fantastic, and it really captures the feel of a baseball game, especially in the highs late in a close game (or better yet, extra innings). Recommended for baseball fans.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orgec33f0a" class="outline-2">
<h2 id="orgec33f0a">Bottom of the 9th</h2>
<div class="outline-text-2" id="text-orgec33f0a">
<p>
Theming is wonderful, but not much of a game underneath it. Pitching/hitting is matching pennies, and the results are dice rolls. I enjoy some light games, but there's just not enough here for me.
</p>

<p>
2/5
</p>
</div>
</div>
<div id="outline-container-orgfcdbcf1" class="outline-2">
<h2 id="orgfcdbcf1">Carcassonne</h2>
<div class="outline-text-2" id="text-orgfcdbcf1">
<p>
One of the best examples of <a href="https://magic.wizards.com/en/articles/archive/making-magic/lenticular-design-2014-12-15">lenticular design</a>. What starts as a simple tile-laying game evolves as you learn strategies and add the farmers rule to become a delicate dance balancing limited meeples, constant consideration of the lay of the land, opportunistic cooperation, even more opportunistic theft. Base game is great, but the Inns &amp; Cathedrals expansions fills it out a bit with some helpful new tiles and new features that makes roads more valuable and cities have greater risks and rewards.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgb97c77e" class="outline-2">
<h2 id="orgb97c77e">Codenames/Codenames: Duet</h2>
<div class="outline-text-2" id="text-orgb97c77e">
<p>
A party game acceptable to gamers and non-gamers alike. Incredibly satisfying both as the cluer and the cluee when it works. The original Codenames has some downtime problems for guessers, while Duet can drag if your partner is slow at coming up with clues. Also very easy for new players to break the rules, which can hurt the experience.
</p>

<p>
3/5
</p>
</div>
</div>
<div id="outline-container-orge642952" class="outline-2">
<h2 id="orge642952">Jaipur</h2>
<div class="outline-text-2" id="text-orge642952">
<p>
Easy to learn but surprisingly deep trading game with meaningful decisions throughout. The short length and randomness from the cards can make luck a factor, but that's not a bad thing.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-orgc5c2a28" class="outline-2">
<h2 id="orgc5c2a28">Pandemic</h2>
<div class="outline-text-2" id="text-orgc5c2a28">
<p>
Although my tastes have gotten a bit heavier since my initial adoration for Pandemic, it still stands up as an accessible, enjoyable, cooperative puzzle I'm happy to bring to the table. It absolutely suffers from quarterbacking, and it can feel a bit samey after a while once you've basically solved the game's core puzzle, but the On the Brink expansion helps with the latter, adding huge variety to the roles and events with some optional modules to spice things up.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org364dd33" class="outline-2">
<h2 id="org364dd33">Patchwork</h2>
<div class="outline-text-2" id="text-org364dd33">
<p>
Somehow equal parts relaxing (it's a polymino game about making a quilt!) and fiercely competitive. Elegant in its simplicity, challenging in its execution, a favorite for head-to-head two-player games.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org3a41e29" class="outline-2">
<h2 id="org3a41e29">Spirit Island</h2>
<div class="outline-text-2" id="text-org3a41e29">
<p>
Spirit Island captures my mind in a way no board game ever has, and only a select few video games have, with every turn an impossible tactical puzzle until a truly inspired combination of powers reveals itself. An utterly brain-burning experience with an embarrassment of riches in terms of content with its expansions. It's both my favorite coop board game and only of the only board games I will happily play solo. My one criticism is that endings are sometimes anticlimactic, though that may also be a sign that the highly customizable difficulty may simply be too low.
</p>

<p>
5/5
</p>
</div>
</div>
<div id="outline-container-org8a0a7ee" class="outline-2">
<h2 id="org8a0a7ee">Sushi Go Party!</h2>
<div class="outline-text-2" id="text-org8a0a7ee">
<p>
My go-to to pull out for non-gamers, but the customizable party version allows both for high replayability and adjustable complexity. It's a very light points-scoring drafting game, but it has legs and it's fun to notice interactions between cards for different menus. Setup is a little slow with having to build the deck every time, which sleeving can help mitigate.
</p>

<p>
4/5
</p>
</div>
</div>
<div id="outline-container-org174bc4b" class="outline-2">
<h2 id="org174bc4b">Viticulture Essential Edition</h2>
<div class="outline-text-2" id="text-org174bc4b">
<p>
A worker placement game elevated by two mechanics I adore: player-chosen turn order, with increasing rewards for later options, and a grande meeple who can take actions whose slots have already been filled. Suffers a good bit from the highly random and swingy visitor cards, some of which are especially unbalanced at high/low player counts (e.g., everyone gives you money, or get victory points for every player who doesn't).
</p>

<p>
4/5
</p>
</div>
</div>
